{
    "LegalRights": [
      {
        "Category": "Freedom of Speech",
        "Description": "You have the right to express your opinions and ideas freely, as long as it does not incite violence or hatred."
      },
      {
        "Category": "Right to Privacy",
        "Description": "You have the right to privacy in your personal life, home, and correspondence. Your personal information should be protected."
      },
      {
        "Category": "Right to a Fair Trial",
        "Description": "You have the right to a fair and impartial trial if you are accused of a crime. This includes the right to legal representation."
      },
      {
        "Category": "Freedom from Discrimination",
        "Description": "You should not be discriminated against based on your race, gender, religion, disability, or other protected characteristics."
      },
      {
        "Category": "Freedom from Torture and Cruel Treatment",
        "Description": "You have the right not to be subjected to torture or cruel, inhuman, or degrading treatment or punishment."
      },
      {
        "Category": "Right to Education",
        "Description": "You have the right to access education without discrimination. Education should be available, accessible, and of good quality."
      },
      {
        "Category": "Right to Work",
        "Description": "You have the right to work in a safe and healthy environment, with fair wages and reasonable working hours."
      },
      {
        "Category": "Freedom of Religion",
        "Description": "You have the right to practice, change, or have no religion, and your beliefs should be respected."
      },
      {
        "Category": "Right to Health",
        "Description": "You have the right to the highest attainable standard of physical and mental health, including access to healthcare services."
      },
      {
        "Category": "Freedom of Assembly and Association",
        "Description": "You have the right to peacefully assemble and form associations or organizations, including political parties and trade unions."
      },
      {
        "Category": "Right to Property",
        "Description": "You have the right to own, use, and dispose of property. Private property should not be taken without just compensation."
      },
      {
        "Category": "Rights of the Child",
        "Description": "Children have special rights, including the right to protection, education, and participation in decisions affecting them."
      },
      {
        "Category": "Right to Equal Pay",
        "Description": "Men and women should receive equal pay for equal work or work of equal value, without discrimination."
      }
    ]
  }
  